Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl
The Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl class represents a control that can be used to display or edit
distances and angles.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.internalControl
The internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.internalValue
The internal value of the control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.internalControlType
The internal control type.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.internalControlTypeSet
The bool for internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.#ctor(System.Nullable{System.Double})
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl class.
value: The value.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.#ctor(Tekla.BIM.DirectManipulation.Services.Controls.ValueControlType,System.Nullable{System.Double})
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl class.
controlType: The value control type.
value: The value.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.GotKeyboardFocus
Event to be called when the control has gotten keyboard focus.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.LostKeyboardFocus
Event to be called when the control has lost keyboard focus.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.StateChanged
Event to be called when the state of the control has changed.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.Title
Sets the title of the control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.Value
Gets or sets the value of the item in the value box.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.Text


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.IsInErrorState
Gets the value for indicating whether the control is in an error state.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.InternalControl


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.OnGotKeyboardFocus(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the got keyboard focus event.
control: The control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.OnLostKeyboardFocus(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the lost keyboard focus event.
control: The control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.OnStateChanged(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the state changed event.
control: The control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ValueBoxControl.TrySetValue(System.String)
Tries to set the current value of the control from a System.String.
text: The new value in text form.
Returns: True if setting of value was successful, otherwise false.